
const win = window as any;

export const languages = {
    label_text: {
        music: "Музика",
        sound: "Звук"
    },
    levels: {
        lvl1: {
            num: "1",
            name: "Перша сутичка",
            intro: "Могутній найманець Резкар зі своєю ватагою прибувають у тихе село, де дізнаються, що його мешканці протистояють грабіжникам. Тугий гаманець швидко переконує найманців стати на захист селян. На захід від села, під криваво червоними  хмарами, розпочалася перша сутичка. З темними фігурами грабіжників зустрілася сталь найманців.",
            ending: "Коли останній грабіжник поліг, жителі радісно висловлюють свою вдячність, піднімаючи пінні келихи на славу найманців.",
        },
        lvl2: {
            num: "2",
            name: "Караван",
            intro: "З села до портового міста Таранкол пролягає торговий шлях, який останнім часом став дуже не спокійним. Загін найманців береться супроводжувати купецький караван через небезпечні землі. На пів дорозі розбійницька банда нападає з засідки, чуючи багату наживу. Резкар підкидає руку, посилаючи знак загону зайняти оборону.",
            ending: "У місті, куди вони супроводжували товар, їх зустрічає вдячний купець. Він кладе пару монет у руку Резкара і задоволений віддаляється. “Куди як дохідніше бути розбійником” - задумався Резкар.",
        },
        lvl3: {
            num: "3",
            name: "Підла помста",
            intro: "Владний покровитель розбійників, прагнучий помститися за своїх підлеглих, вміло обумовлює Резкара перед міською Радою, висунувши зловісні звинувачення у звірячих злочинах. Загони стражників за наказом Ради оточують найманців. Бій у вузьких вулицях міста стане важким випробуванням…",
            ending: "Найманці з боями пробиваються до порту і захоплюють корабель, на якому, нарешті, вони врятовуються втечею від невиправданої жорстокості міщан.",
        },
        lvl4: {
            num: "4",
            name: "Морський бій",
            intro: "Але, відпливши на кораблі, найманці не отримують такого бажаного порятунку. У гонитву за Резкаром відправляють, жадібного до слави, капітана-головоріза. Будучи досвідченим мореплавцем, він наздоганяє корабель Резкара і бере його на абордаж. Ось-ось розпочнеться буря сталевих клинків і гучних заклинань.",
            ending: "У битві на палубі проливається море крові, але корабель з найманцями, вцілілими у бою, причалює до причалу порту великого міста, де завжди знайдеться місце хорошим воїнам.",
        },
        lvl5: {
            num: "5",
            name: "Скарби давнини",
            intro: "Місто, в яке прибула ватага, називалося Брей. У першому ж портовому трактирі, куди заглянув Резкар, йшло активне наймання добровольців в армію місцевого Лорда. За чутками, готувався похід за якимсь артефактом, додатком до багатої колекції Лорда. І вже кілька днів потому, дружина найманців опинилася під стінами давнього монастиря високо в горах, де розгорілася запекла битва.",
            ending: "У той момент, коли пухка рука Лорда потягнулася до скарбу, який блищав на долоні Резкара, найманець швидким махом меча розірвав угоду. Резкар, загадково хмикнув і оголосив себе новим володарем таємничої речі.",
        },
        lvl6: {
            num: "6",
            name: "Міст",
            intro: "Похмура сила, яка в останній час терзала найманців, в результаті, підкорила Резкара і його людей. Жага влади наповнила їх душі і армія рушила до столиці королівства, міста Дульмір. Єдина переправа через бурхливі, глибокі води могутньої ріки відділяла найманців від прямої дороги на столицю. Кам’яний міст, заставлений щільними рядами ворогів, перетворюється на арену смертельного протистояння.",
            ending: "Резкар, борючись на вузькому переході, відчуває важкість кожного руху, дивлячись, як внизу вирує темна вода. “ Скупатися б” - подумав Резкар, але купатися відправив чергового суперника.",
        },
        lvl7: {
            num: "7",
            name: "Генеральна битва",
            intro: "На безкрайньому осінньому полі Резкара зустріла, розгорнувши всі прапори, армія короля. Сонце, затемнене чорними хмарами війни, не бажало світити, передчуваючи траурний день. Відчуваючи в собі абсолютну незламність, Резкар, як могутній потік, що загрожує змити все на шляху, кинувся зі своєю дружиною на стрункі полки ворогів.",
            ending: "Змішаний запах крові і палаючих полів наповнює повітря, а земля просочується стражданням. Резкар не був хліборобом, тому удобрював землю, як міг.",
        },
        lvl8: {
            num: "8",
            name: "Пролом в стінах",
            intro: "Вже третій місяць йде облога Дульмір, давнього міста з високими кам’яними стінами і храмами, оздобленими прекрасними фресками і різьбою. З кожним днем все більше і більше стрясаючих ударів облогових машин Резкара. З кожною годиною солдати на стінах втрачають все більше товаришів і надію. З кожною хвилиною пролом в стіні стає все ширше і глибше.",
            ending: "Неприступні стіни Дульмір впали разом з надіями захисників, які були зметені. У місто хлинули війська Резкара.",
        },
        lvl9: {
            num: "9",
            name: "Остання надія",
            intro: "Міщани, відчуваючи, що Резкар несе загибель всім, взялися за зброю в останній надії оборонитися. Мешканці столиці від малого до старого, в перемішку з залишками королівського війська, зустріли Руйнівника життя на центральній міській площі. Вони були погано озброєні і одягнені, але повні рішучості і гніву. Вони тримали в руках коси, вили, ножі, сокири, луки, списи, мечі, щити, що було під рукою. Вони кричали, молилися, плакали, але нестримно кидалися в бій. Вони знали, що це їх останній шанс.",
            ending: "Міська площа, яка була місцем радості і веселощів, стала ареною трагедії. Мертве місто. Потріпані залишки війська Резкара рушили до замку короля. Їх залишалося занадто мало. Вкриті кров’ю, потом і брудом вони були повні торжества і злоби.",
        },
        lvl10: {
            num: "10",
            name: "Чия корона?",
            intro: "Заключна битва розгортається всередині замку, де Резкар і залишки його соратників зіштовхуються з особистою гвардією великого правителя. Звуки мечів, стогін поранених наповнюють зали. Король не бажає віддавати свій трон без боротьби.",
            ending: "На троні, темному і липкому від крові, сидить новий король, з посмішкою дивлячись на пусті зали палацу, пусті вулиці міста, на пусті землі і пустоту всередині себе. А поруч, поклавши долоню на плече Резкара, радісно і задоволено хихикало Зло, вже не ховаючись у надрах старовинної дивної речі з розруйнованого монастиря.",
        },
        lvl_arena: {
            num: "...",
            name: "Арена",
            intro: "Бій випадкових бійців із різними здібностями на арені. Просувайся за сюжетом, щоб відкривати нові карти для арени.",
            ending: "",
        }
    },
    cards: {
        meteorRain: {
            name: "Метеоритний дощ",
            description: "На небесному полотні розходяться тріщини, і з них починають падати палаючі уламки космічного походження. Їх удари вибухають, немов вогняні снаряди, залишаючи за собою вихори пилу і вогню. <br/><br/> знищує 15 випадкових плиток ворога.",
        },
        champion: {
            name: "Чемпіон",
            description: "Під прапором короля стоїть легендарний боєць, воїн без міри, втілення сили та руйнівного напору. Його ім’я — прокляття для ворогів і священне для союзників. <br/><br/> Замінює одну випадкову плитку гравця на чемпіона. Має 2 життя. Знищує 2 плитки, що стоять попереду.",
        },
        firewall: {
            name: "Вогняна стіна (Сильна)",
            description: "Повітря густіє, насичуючись гострим запахом сірки, огортає простір і, умить, спалахує всепоглинаючою вогняною стіною. <br/><br/> Згоряє 7 плитки в колонці ворога.",
        },
        firewallLow: {
            name: "Вогняна стіна (Слабка)",
            description: "Повітря густіє, насичуючись гострим запахом сірки, огортає простір і, умить, спалахує всепоглинаючою вогняною стіною. <br/><br/> Згоряє 3 плитки в колонці ворога.",
        },
        firewallMiddle: {
            name: "Вогняна стіна (Середня)",
            description: "Повітря густіє, насичуючись гострим запахом сірки, огортає простір і, умить, спалахує всепоглинаючою вогняною стіною. <br/><br/> Згоряє 5 плитки в колонці ворога.",
        },
        lightning: {
            name: "Блискавка (Сильна)",
            description: "Небо розривається осліплюючим світлом. Блискавки, немов іскристі кинджали богів, розривають простір своїм безжальним танцем. <br/><br/> Атакує поле ворога і знищує 11 випадкових клітинок.",
        },
        lightningLow: {
            name: "Блискавка (Слабка)",
            description: "Небо розривається осліплюючим світлом. Блискавки, немов іскристі кинджали богів, розривають простір своїм безжальним танцем. <br/><br/> Атакує поле ворога і знищує 5 випадкових клітинок.",
        },
        lightningMiddle: {
            name: "Блискавка (Середня)",
            description: "Небо розривається осліплюючим світлом. Блискавки, немов іскристі кинджали богів, розривають простір своїм безжальним танцем. <br/><br/> Атакує поле ворога і знищує 8 випадкових клітинок.",
        },
        totem: {
            name: "Тотем (Сильний)",
            description: "Посеред пагорба підноситься різьблений стовп, його поверхня увішана таємничими рунами. Немов вартовий давніх таємниць, він непохитно дивиться крізь часи. <br/><br/> амінює 2 випадкові плитки гравця на тотеми. Тотеми мають 2 життя.",
        },
        totemLow: {
            name: "Тотем (Слабкий)",
            description: "Посеред пагорба підноситься різьблений стовп, його поверхня увішана таємничими рунами. Немов вартовий давніх таємниць, він непохитно дивиться крізь часи. <br/><br/> амінює 2 випадкові плитки гравця на тотеми.",
        },
        mine: {
            name: "Міна (Сильна)",
            description: "Пустельна рівнина обманливо спокійна, але в її серці схована смертельна пастка. Земля раптово здіймається, викидаючи вогонь і металевий запах. <br/><br/> Міна ставиться на поле ворога і вибухає після ходу суперника, знищуючи 5 ворожих плиток.",
        },
        mineLow: {
            name: "Міна (Слабка)",
            description: "Пустельна рівнина обманливо спокійна, але в її серці схована смертельна пастка. Земля раптово здіймається, викидаючи вогонь і металевий запах. <br/><br/> Міна ставиться на поле ворога і вибухає після ходу суперника, знищуючи 3 ворожі плитки в стовпці.",
        },
        meteorite: {
            name: "Метеорит (Сильний)",
            description: "Небо тріщить, коли вогняний метеорит вривається в атмосферу, залишаючи за собою іскристий слід і передчуття неминучої катастрофи.  <br/><br/> Знищує 9 ворожих плиток, формуючи хрест.",
        },
        meteoriteLow: {
            name: "Метеорит (Слабкий)",
            description: "Небо тріщить, коли вогняний метеорит вривається в атмосферу, залишаючи за собою іскристий слід і передчуття неминучої катастрофи.  <br/><br/> Знищує плитку ворога",
        },
        meteoriteMiddle: {
            name: "Метеорит (Середній)",
            description: "Небо тріщить, коли вогняний метеорит вривається в атмосферу, залишаючи за собою іскристий слід і передчуття неминучої катастрофи.  <br/><br/> Знищує 5 ворожих плиток, формуючи хрест.",
        },
        recruit: {
            name: "",
            description: "",
        },
        catapult: {
            name: "Баліста (Сильна)",
            description: "На пагорбі підноситься масивна баліста, дерев’яні ручки напружені, канати натягнуті до межі, лише мить до смертоносного польоту. <br/><br/> Баліста замінює плитку на полі гравця. Кожного разу, при завершенні ходу противника, баліста забирає 5 од. життя у ворожого героя.",
        },
        catapultLow: {
            name: "Баліста (Слабка)",
            description: "На пагорбі підноситься масивна баліста, дерев’яні ручки напружені, канати натягнуті до межі, лише мить до смертоносного польоту. <br/><br/> Баліста замінює плитку на полі гравця. Кожного разу, при завершенні ходу противника, баліста забирає 3 од. життя у ворожого героя.",
        },
        shaman: {
            name: "Шаман (Сильний)",
            description: "Методичний бій бубна і глибокий гортанний наспів закликають сили природи і тіні давніх духів. У очах шамана відбивається безмежна могутність лісу і стає інгредієнтом у його великій цілющій сутності. <br/><br/> Шаман замінює плитку на полі гравця. Кожного разу, при завершенні ходу противника, шаман підвищує на 5 од. здоров’я свого героя.",
        },
        shamanLow: {
            name: "Шаман (Слабкий)",
            description: "Методичний бій бубна і глибокий гортанний наспів закликають сили природи і тіні давніх духів. У очах шамана відбивається безмежна могутність лісу і стає інгредієнтом у його великій цілющій сутності. <br/><br/> Шаман замінює плитку на полі гравця. Кожного разу, при завершенні ходу противника, шаман підвищує на 3 од. здоров’я свого героя.",
        },
        c_attack: {
            name: "Контратака",
            description: "Ті, хто був на межі загибелі, хто втратив останню надію, раптом надихаються і, зібравши останні сили, відкидають ворога, коли між рядами розноситься величний клич Героя. <br/><br/> В 3х випадкових колонках знищуються по 3 ворожі плитки.",
        },
        worm: {
            name: "Хробак (Сильний)",
            description: "Земля тремтить і тріскається, знак біди, що насувається. З бездонних глибин повстає Хробак. Він непохитно пожирає лави військ противника. Крики і стогін поглинених ворогів довго не замовкають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра. <br/><br/> Знищує до 8ми ворожих плиток одну за одною.",
        },
        wormMiddle: {
            name: "Хробак (Середній)",
            description: "Земля тремтить і тріскається, знак біди, що насувається. З бездонних глибин повстає Хробак. Він непохитно пожирає лави військ противника. Крики і стогін поглинених ворогів довго не замовкають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра. <br/><br/> Знищує до 6ти ворожих плиток одну за одною.",
        },
        wormLow: {
            name: "Хробак (Слабкий)",
            description: "Земля тремтить і тріскається, знак біди, що насувається. З бездонних глибин повстає Хробак. Він непохитно пожирає лави військ противника. Крики і стогін поглинених ворогів довго не замовкають під землею, відлуння тимчасово вгамованого, але вічно голодного звіра. <br/><br/> Знищує до 4х ворожих плиток одну за одною.",
        },
        pike: {
            name: "Спис Бога (Сильний)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідступною точністю, залишаючи за собою лише попіл. <br/><br/> Знищує 9 ворожих плиток, формуючи наконечник списа",
        },
        pikeLow: {
            name: "Спис Бога (Слабкий)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідступною точністю, залишаючи за собою лише попіл. <br/><br/> Знищує 3 ворожих плиток, формуючи наконечник списа",
        },
        pikeMiddle: {
            name: "Спис Бога (Середній)",
            description: "Могутня зброя, що випромінює яскраве світло божественної енергії. Його наконечник пронизує ряди ворогів з невідступною точністю, залишаючи за собою лише попіл. <br/><br/> Знищує 5 ворожих плиток, формуючи наконечник списа",
        },
        push: {
            name: "Натиск",
            description: "Армія готується до атаки, мечі мерехтять, щити стикаються, а в очах солдатів горить полум’я рішучості. В цей момент, лунає бойовий ріг. <br/><br/> Знищується задній ворожий ряд.",
        },
        berserk: {
            name: "Берсерк (Сильний)",
            description: "У самому центрі битви з’являється воїн, окутий біснуванням. У його очах дика пристрасть, а кожен його удар - невтримна лють. <br/><br/> На полі гравця випадковим чином з’являються 2 берсерка, замінюючи 2 плитки.",
        },
        berserkLow: {
            name: "Берсерк (Слабкий)",
            description: "У самому центрі битви з’являється воїн, окутий біснуванням. У його очах дика пристрасть, а кожен його удар - невтримна лють. <br/><br/> На полі гравця випадково з'являються 1 берсерк, замінюючи дружню плитку. Атакує плитку ворога",
        },
        assassin: {
            name: "Асасін (Сильний)",
            description: "Безшумно, непомітний оку, він наближається до цілі, немов тінь у мороці ночі, передвісник неминучого. <br/><br/> Плитка на полі гравця замінюється на асасіна. В кінці ходу противника, асасін знищує 2 випадкові плитки ворога.",
        },
        assassinLow: {
            name: "Асасін (Слабкий)",
            description: "Безшумно, непомітний оку, він наближається до цілі, немов тінь у мороці ночі, передвісник неминучого. <br/><br/> Плитка на полі гравця замінюється на асасіна. В кінці ходу противника, асасін знищує 1 випадкову плитку ворога.",
        },
        shield: {
            name: "Щит",
            description: "Солдати шикуються в броньовану позицію, виставляючи щити і наїжачившись списами, готові відбити будь-яку атаку. <br/><br/> Група однотипних плиток отримує недоторканність до наступного ходу гравця.",
        },
        hammer: {
            name: "Молот Бога (Сильний)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грому, а земля розривається під натиском давньої сили. <br/><br/> Знищує 9 ворожих плиток, формуючи кувалду.",
        },
        hammerLow: {
            name: "Молот Бога (Слабкий)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грому, а земля розривається під натиском давньої сили. <br/><br/> Знищує 3 ворожих плиток, формуючи кувалду.",
        },
        hammerMiddle: {
            name: "Молот Бога (Середній)",
            description: "На арені великих битв піднімається Молот Бога, його руйнівні удари вибухають розкатами грому, а земля розривається під натиском давньої сили. <br/><br/> Знищує 6 ворожих плиток, формуючи кувалду.",
        },
        maneuver: {
            name: "Маневр",
            description: "Хмари пилу піднімаються серед поля битви, армія стрімко перебудовується, немов живий організм, що підкоряється невидимим наказам досвідченого командира. <br/><br/> Перемішує поле навколо цільової плитки.",
        },
        panic: {
            name: "Паніка",
            description: "Незбагненний страх поступово прокрадається серед ворожих рядів. Крики жаху зливаються в безлику масу, немов прокляття. В цю мить війська втрачають залишки стійкості. <br/><br/> Плитки поруч з цільовою отримують той же тип.",
        },
    }
};

if (!win.languages) {
    win.languages = {};
}

win.languages.ua = languages;
